Repository: na-596/Logic-Simulator-Project
Catalog: logsim/locale/*/LC_MESSAGES/messages.po
Languages: es_es, kn_in, ta_in

source: Logic Simulator
es_es: Simulador de lógica
kn_in: ತಾರ್ಕಿಕ ಅನುಕರಕ
ta_in: தர்க்க ஒத்திகையாளர்

source: Failed to toggle switch {switch_name}
es_es: Error al cambiar el interruptor {switch_name}
kn_in: {switch_name} ಸ್ವಿಚ್ ತಿರುವಲು ವಿಫಲವಾಯಿತು
ta_in: {switch_name} சுவிட்சை மாற்ற இயலவில்லை

source: &About
es_es: &Acerca de
kn_in: &ಬಗ್ಗೆ
ta_in: &பற்றி

source: &Help F1
es_es: Ayuda F1
kn_in: &ಸಹಾಯ F1
ta_in: &உதவி F1

source: E&xit Alt+F4
es_es: Salir Alt+F4
kn_in: &ನಿರ್ಗಮಿಸು Alt+F4
ta_in: வெளியேறு Alt+F4

source: &File
es_es: &Archivo
kn_in: &ಫೈಲ್
ta_in: &கோப்பு

source: Ready
es_es: Listo
kn_in: ಸಿದ್ಧವಾಗಿದೆ
ta_in: தயார்

source: Simulation Controls
es_es: Controles de simulación
kn_in: ಅನುಕರಣ ನಿಯಂತ್ರಣಗಳು
ta_in: ஒத்திகை கட்டுப்பாடுகள்

source: Speed:
es_es: Velocidad:
kn_in: ವೇಗ:
ta_in: வேகம்:

source: Number of Cycles:
es_es: Número de ciclos:
kn_in: ಚಕ್ರಗಳ ಸಂಖ್ಯೆ:
ta_in: சுழற்சி எண்ணிக்கை:

source: ▶ Run Simulation
es_es: ▶ Simulación de ejecución
kn_in: ▶ ಅನುಕರಣ ಚಾಲನೆ
ta_in: ▶ ஒத்திகையை இயக்கு

source: ❚❚ Pause
es_es: ❚❚ Pausa
kn_in: ❚❚ ತಡೆ
ta_in: ❚❚ இடைநிறுத்து

source: ■ Reset
es_es: ■ Restablecer
kn_in: ■ ಮರುಹೊಂದಿಸು
ta_in: ■ மீட்டமை

source: Switch Controls
es_es: Controles de interruptores
kn_in: ಸ್ವಿಚ್ ನಿಯಂತ್ರಣಗಳು
ta_in: சுவிட்ச் கட்டுப்பாடுகள்

source: Switch
es_es: Interruptor
kn_in: ಸ್ವಿಚ್
ta_in: சுவிட்ச்

source: State
es_es: Estado
kn_in: ಸ್ಥಿತಿ
ta_in: நிலை

source: All On
es_es: Todo encendido
kn_in: ಎಲ್ಲವೂ ಓನ್
ta_in: அனைத்தும் இயக்கம்

source: All Off
es_es: Todo apagado
kn_in: ಎಲ್ಲವೂ ಆಫ್
ta_in: அனைத்தும் அணை

source: Monitors
es_es: Monitores
kn_in: ಮോണಿಟರ್‌ಗಳು
ta_in: மாணிட்டர்கள்

source: Signal
es_es: Señal
kn_in: ಸಂकेत
ta_in: சிக்னல்

source: Add Monitor(s)
es_es: Agregar monitor(s)
kn_in: ಮುನ್ಸೂಚಕ(ಗಳನ್ನು) ಸೇರಿಸು
ta_in: மாணிட்டர்(களை) சேர்க்க

source: Zap All
es_es: Eliminar todos
kn_in: ಎಲ್ಲವನ್ನೂ ಅಳಿಸು
ta_in: அனைத்தையும் அகற்று

source: How to Use the Logic Simulator GUI --- **Keybinds** - **F1:** Show this Help window - **Alt+F4:** Exit the application - **Spacebar:** Run/Pause the simulation **Simulation Controls** - **Number of Cycles:** Set how many cycles to run the simulation for. - **▶ Run Simulation:** Start the simulation for the chosen number of cycles. - **❚❚ Pause:** Pause the simulation at any time. - **■ Reset:** Reset the simulation and clear all monitor data. - **Speed:** Click to cycle through simulation speeds (x0.5, x1, x2, x4, x8). **Switch Controls** - Toggle individual switches by clicking the switch in the list. - Use **All On** or **All Off** to set all switches high or low. **Monitors** - Add a monitor to track a signal by clicking **Add Monitor** and selecting a signal. - Use **Add All** in the dialog to monitor all available signals. - Remove a monitor by clicking the ✕ button next to it, or **Zap All** to remove all monitors. - The monitor list shows the current state of each monitored signal. **Signal Display Canvas** - The main area shows waveforms for all monitored signals. - **Pan:** Click and drag to move the view. - **Zoom:** Use the mouse wheel to zoom in/out. - Signal colors match the color bars in the monitor list. **Themes** - Switch between Light and Dark mode from the Theme menu. **Status Bar** - The status bar at the bottom shows helpful messages and feedback. For more help, see the project documentation or contact the authors.
es_es: Cómo usar la interfaz gráfica del Simulador Lógico --- **Atajos de teclado** - **F1:** Mostrar esta ventana de ayuda - **Alt+F4:** Salir de la aplicación - **Barra espaciadora:** Ejecutar/Pausar la simulación **Controles de simulación** - **Número de ciclos:** Establecer cuántos ciclos ejecutar en la simulación. - **▶ Ejecutar simulación:** Iniciar la simulación con el número de ciclos elegido. - **❚❚ Pausa:** Pausar la simulación en cualquier momento. - **■ Reiniciar:** Reiniciar la simulación y borrar todos los datos de los monitores. - **Velocidad:** Haz clic para cambiar la velocidad de simulación (x0.5, x1, x2, x4, x8). **Controles de interruptores** - Activa o desactiva interruptores individuales haciendo clic en ellos en la lista. - Usa **Encender todos** o **Apagar todos** para poner todos los interruptores en alto o bajo. **Monitores** - Agrega un monitor para seguir una señal haciendo clic en **Agregar monitor** y seleccionando una señal. - Usa **Agregar todos** en el cuadro de diálogo para monitorear todas las señales disponibles. - Elimina un monitor haciendo clic en el botón ✕ junto a él, o **Eliminar todos** para borrar todos los monitores. - La lista de monitores muestra el estado actual de cada señal monitoreada. **Lienzo de visualización de señales** - El área principal muestra formas de onda de todas las señales monitoreadas. - **Desplazar:** Haz clic y arrastra para mover la vista. - **Zoom:** Usa la rueda del ratón para acercar/alejar. - Los colores de las señales coinciden con las barras de color en la lista de monitores. **Temas** - Cambia entre el modo Claro y Oscuro desde el menú de temas. **Barra de estado** - La barra de estado inferior muestra mensajes útiles y retroalimentación. Para más ayuda, consulta la documentación del proyecto o contacta con los autores.
ta_in: தர்க்க ஒத்திகை GUI-ஐ பயன்படுத்துவது எப்படி --- **முக்கிய குறுக்குவழிகள்** - **F1:** இந்த உதவி சாளரத்தை காண்பி - **Alt+F4:** பயன்பாட்டிலிருந்து வெளியேறு - **இடைவெளி பட்டன்:** ஒத்திகையை இயக்கு/இடைநிறுத்து **ஒத்திகை கட்டுப்பாடுகள்** - **சுழற்சி எண்ணிக்கை:** எத்தனை சுழற்சிகளுக்காக ஒத்திகையை இயக்க வேண்டும் என்பதை அமைக்கவும். - **▶ ஒத்திகையை இயக்கு:** தேர்ந்தெடுக்கப்பட்ட சுழற்சி எண்ணிக்கைக்கு ஒத்திகையை தொடங்கு. - **❚❚ இடைநிறுத்து:** எப்போதும் ஒத்திகையை இடைநிறுத்தலாம். - **■ மீட்டமை:** ஒத்திகையை மீட்டமைத்து அனைத்து மாணிட்டர் தரவையும் அழிக்கவும். - **வேகம்:** ஒத்திகை வேகங்களை மாற (x0.5, x1, x2, x4, x8) கிளிக் செய்யவும். **சுவிட்ச் கட்டுப்பாடுகள்** - பட்டியலில் உள்ள சுவிட்சை கிளிக் செய்வதன் மூலம் தனிப்பட்ட சுவிட்சுகளை மாற்றவும். - **அனைத்தும் இயக்கம்** அல்லது **அனைத்தும் அணை** ஐ பயன்படுத்தி அனைத்து சுவிட்சுகளையும் உயரமாக அல்லது குறைவாக அமைக்கவும். **மாணிட்டர்கள்** - ஒரு சிக்னலை கண்காணிக்க ஒரு மாணிட்டரைச் சேர்க்க **மாணிட்டர் சேர்க்க** என்பதை கிளிக் செய்து சிக்னலை தேர்ந்தெடுக்கவும். - உரையாடல் பெட்டியில் உள்ள **அனைத்தையும் சேர்க்க** என்பதை பயன்படுத்தி எல்லா சிக்னல்களையும் கண்காணிக்கவும். - ✕ பொத்தானை அழுத்துவதன் மூலம் ஒரு மாணிட்டரை அகற்றலாம் அல்லது **அனைத்தையும் அகற்று** மூலம் எல்லாவற்றையும் அகற்றலாம். - மாணிட்டர் பட்டியல் ஒவ்வொரு கண்காணிக்கப்பட்ட சிக்னலின் தற்போதைய நிலையை காட்டுகிறது. **சிக்னல் காட்சி கன்வாஸ்** - முக்கிய பகுதி அனைத்து சிக்னல்களின் அலைவடிவங்களை காட்டுகிறது. - **சறுக்கு:** பார்வையை நகர கிளிக் செய்து இழுக்கவும். - **பெரிதாக்க/சிறிதாக்க:** சுழற்பலகையைப் பயன்படுத்தவும். - சிக்னல் நிறங்கள் மாணிட்டர் பட்டியலில் உள்ள நிறப்பட்டைகளுடன் ஒத்திருக்கின்றன. **தீம்கள்** - தீம் மெனுவிலிருந்து வெளிச்சம்/இருள் முறையை மாற்றலாம். **நிலைப் பட்டை** - கீழே உள்ள நிலைப் பட்டையில் பயன்பாட்டு தகவல்கள் மற்றும் பின்னூட்டம் காட்டப்படும். மேலும் உதவிக்கு, திட்ட ஆவணங்களைப் பார்க்கவும் அல்லது உருவாக்குநர்களை தொடர்பு கொள்ளவும்.

source: Help: How to Use the Logic Simulator
es_es: Ayuda: Cómo usar el simulador lógico
ta_in: உதவி: தர்க்க ஒத்திகையாளரை எப்படி பயன்படுத்துவது

source: Logic Simulator Created by: Ayoife Dada Narmeephan Arunthavarajah Raghavendra Narayan Rao 2025
es_es: Simulador lógico Creado por: Ayoife Dada Narmeephan Arunthavarajah Raghavendra Narayan Rao 2025
kn_in: ತಾರ್ಕಿಕ ಅನುಕರಕ ರಚಿಸಿದವರು: ಅಯೋಫೆ ದಡಾ ನರ್ಮೀಪನ್ ಅರುಂದವರಾಜಾ ರಾಘವೇಂದ್ರ ನರಾಯಣ ರಾವ್ 2025
ta_in: தர்க்க ஒத்திகையாளர் உருவாக்கியோர்: அயோய்ஃபே டாடா நர்மீபான் அருந்தவராஜா ராகவேந்திர நாராயண ராவ் 2025

source: About Logsim
es_es: Acerca de Logsim
kn_in: Logsim ಬಗ್ಗೆ
ta_in: Logsim பற்றி

source: Simulation already running
es_es: Simulación que ya está en funcionamiento
kn_in: ಅನುಕರಣ ಈಗಾಗಲೇ ನಡೆಯುತ್ತಿದೆ
ta_in: ஒத்திகை ஏற்கனவே இயங்குகிறது

source: Simulation stopped
es_es: La simulación se detuvo
kn_in: ಅನುಕರಣ ನಿಲ್ಲಿಸಲಾಗಿದೆ
ta_in: ஒத்திகை நிறுத்தப்பட்டது

source: Simulation reset
es_es: Reinicio de simulación
kn_in: ಅನುಕರಣ ಮರುಹೊಂದಿಸಲಾಗಿದೆ
ta_in: ஒத்திகை மீட்டமைக்கப்பட்டது

source: Simulation completed
es_es: Simulación completada
kn_in: ಅನುಕರಣ ಪೂರ್ಣಗೊಂಡಿದೆ
ta_in: ஒத்திகை முடிந்தது

source: Simulation error occurred
es_es: Se produjo un error de simulación
kn_in: ಅನುಕರಣ ದೋಷ ಸಂಭವಿಸಿದೆ
ta_in: ஒத்திகை பிழை ஏற்பட்டது

source: Running simulation for {num_cycles} cycles...
es_es: Ejecutando simulación por {num_cycles} ciclos...
kn_in: {num_cycles} ಚಕ್ರಗಳ ಅನುಕರಣ ನಡೆಯುತ್ತಿದೆ...
ta_in: {num_cycles} சுழற்சிகளுக்காக ஒத்திகை இயக்கப்படுகிறது...

source: Error during simulation: {str(e)}
es_es: Error durante la simulación: {str (e)}
kn_in: ಅನುಕರಣದ ವೇಳೆ ದೋಷ: {str(e)}
ta_in: ஒத்திகையின் போது பிழை: {str(e)}

source: Simulation Error
es_es: Error de simulación
kn_in: ಅನುಕರಣ ದೋಷ
ta_in: ஒத்திகை பிழை

source: Zapped monitor for {signal_name}
es_es: Monitor eliminado para {signal_name}
kn_in: {signal_name} ಸಂಕೆತದ ಮುನ್ಸೂಚಕ ಅಳಿಸಲಾಗಿದೆ
ta_in: {signal_name} க்கான மாணிட்டர் அகற்றப்பட்டது

source: Failed to zap monitor {signal_name}
es_es: No se pudo eliminar el monitor {signal_name}
kn_in: {signal_name} ಮುನ್ಸೂಚಕ ಅಳಿಸಲು ವಿಫಲವಾಯಿತು
ta_in: {signal_name} க்கான மாணிட்டரை அகற்ற முடியவில்லை

source: Error
kn_in: ದೋಷ
ta_in: பிழை

source: No more signals available to monitor
es_es: No más señales disponibles para monitorear
kn_in: ಮುನ್ಸೂಚಿಸಲು ಇನ್ನಷ್ಟು ಸಂಕೆತಗಳಿಲ್ಲ
ta_in: கண்காணிக்க மேலும் சிக்னல்கள் இல்லை

source: Information
es_es: Información
kn_in: ಮಾಹಿತಿ
ta_in: தகவல்

source: Added monitor for {signal_name}
es_es: Monitor agregado para {signal_name}
kn_in: {signal_name} ಸಂಕೆತಕ್ಕೆ ಮುನ್ಸೂಚಕ ಸೇರಿಸಲಾಗಿದೆ
ta_in: {signal_name} க்கான மாணிட்டர் சேர்க்கப்பட்டது

source: Failed to add monitor for {signal_name}
es_es: No se pudo agregar el monitor para {signal_name}
kn_in: {signal_name} ಮುನ್ಸೂಚಕ ಸೇರಿಸಲು ವಿಫಲವಾಯಿತು
ta_in: {signal_name} க்கான மாணிட்டரைச் சேர்க்க முடியவில்லை

source: No signals available to monitor
es_es: No hay señales disponibles para monitorear
kn_in: ಮುನ್ಸೂಚಿಸಲು ಸಂಕೆತಗಳಿಲ್ಲ
ta_in: கண்காணிக்க சிக்னல்கள் இல்லை

source: Add all {len(non_monitored)} available signals?
es_es: ¿Agregar todas las {len(non_monitored)} señales disponibles?
kn_in: ಎಲ್ಲಾ ಲಭ್ಯವಿರುವ {len(non_monitored)} ಸಂಕೆತಗಳನ್ನು ಸೇರಿಸುವುದೆ?
ta_in: {len(non_monitored)} கிடைக்கும் சிக்னல்களையும் சேர்க்கவா?

source: Confirm Add All
es_es: Confirmar agregar todo
kn_in: ಎಲ್ಲವನ್ನೂ ಸೇರಿಸುವುದನ್ನು ಖಚಿತಪಡಿಸಿ
ta_in: அனைத்தையும் சேர்க்க உறுதிசெய்க

source: Toggled {switch_name} to {'HIGH' if new_state == parent.devices.HIGH else 'LOW'}
es_es: Cambió {switch_name} a {'ALTO' si new_state == parent.devices.HIGH else 'BAJO'}
kn_in: {switch_name} ಅನ್ನು {'ಹೈ' if new_state == parent.devices.HIGH else 'ಲೋ'} ಗೆ ತಿರುಗಿಸಲಾಗಿದೆ
ta_in: {switch_name} ஐ {'HIGH' if new_state == parent.devices.HIGH else 'LOW'} என மாற்றப்பட்டது

source: [Activated] Toggled {switch_name} to {'HIGH' if new_state == parent.devices.HIGH else 'LOW'}
es_es: [Activado] Cambió {switch_name} a {'ALTO' si new_state == parent.devices.HIGH else 'BAJO'}
kn_in: [ಸಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ] {switch_name} ಅನ್ನು {'ಹೈ' if new_state == parent.devices.HIGH else 'ಲೋ'} ಗೆ ತಿರುಗಿಸಲಾಗಿದೆ
ta_in: [செயல்படுத்தப்பட்டது] {switch_name} ஐ {'HIGH' if new_state == parent.devices.HIGH else 'LOW'} என மாற்றப்பட்டது

source: Added {success_count} monitors
es_es: Se agregaron {success_count} monitores
kn_in: {success_count} ಮುನ್ಸೂಚಕಗಳನ್ನು ಸೇರಿಸಲಾಗಿದೆ
ta_in: {success_count} மாணிட்டர்கள் சேர்க்கப்பட்டனர்

source: No monitors to zap
es_es: No hay monitores para eliminar
kn_in: ಅಳಿಸಲು ಯಾವುದೇ ಮುನ್ಸೂಚಕಗಳಿಲ್ಲ
ta_in: அகற்ற மாணிட்டர்கள் இல்லை

source: Are you sure you want to zap all monitors?
es_es: ¿Estás seguro de que quieres eliminar todos los monitores?
kn_in: ನೀವು ಖಚಿತವಾಗಿಯೂ ಎಲ್ಲಾ ಮುನ್ಸೂಚಕಗಳನ್ನು ಅಳಿಸಲು ಇಚ್ಛಿಸುತ್ತೀರಾ?
ta_in: அனைத்து மாணிட்டர்களையும் நீக்க விரும்புகிறீர்களா?

source: Confirm Zap All
es_es: Confirmar eliminar todos
kn_in: ಎಲ್ಲವನ್ನೂ ಅಳಿಸುವುದನ್ನು ಖಚಿತಪಡಿಸಿ
ta_in: அனைத்தையும் நீக்க உறுதிசெய்க

source: Zapped all {monitor_count} monitors
es_es: Se eliminaron los {monitor_count} monitores
kn_in: ಎಲ್ಲಾ {monitor_count} ಮುನ್ಸೂಚಕಗಳನ್ನು ಅಳಿಸಲಾಗಿದೆ
ta_in: {monitor_count} மாணிட்டர்கள் நீக்கப்பட்டனர்

source: Error: Network oscillating
es_es: Error: oscilación de red
kn_in: ದೋಷ: ನೆಟ್‌ವರ್ಕ್ ಕಂಪಿತವಾಗುತ್ತಿದೆ
ta_in: பிழை: பிணையம் அலைவுறுகிறது

source: All switches set to ON
es_es: Todos los interruptores en ON
kn_in: ಎಲ್ಲಾ ಸ್ವಿಚ್‌ಗಳನ್ನು ಓನ್‌ಗೆ ಹೊಂದಿಸಲಾಗಿದೆ
ta_in: அனைத்து சுவிட்சுகள் இயக்கப்பட்டன

source: All switches set to OFF
es_es: Todos los interruptores en OFF
kn_in: ಎಲ್ಲಾ ಸ್ವಿಚ್‌ಗಳನ್ನು ಆಫ್‌ಗೆ ಹೊಂದಿಸಲಾಗಿದೆ
ta_in: அனைத்து சுவிட்சுகள் அணைக்கப்பட்டன

source: Switched to Light Mode
es_es: Cambiado a modo claro
kn_in: ಲೈಟ್ ಮೋಡ್‌ಗೆ ಬದಲಾಗಿದೆ
ta_in: ஒளி பயன்முறைக்கு மாற்றப்பட்டது

source: Switched to Dark Mode
es_es: Cambiado a modo oscuro
kn_in: ಡಾರ್ಕ್ ಮೋಡ್‌ಗೆ ಬದಲಾಗಿದೆ
ta_in: இருள் பயன்முறைக்கு மாற்றப்பட்டது

source: Light Mode
es_es: Modo claro
kn_in: ಲೈಟ್ ಮೋಡ್
ta_in: ஒளி பயன்முறை

source: Dark Mode
es_es: Modo oscuro
kn_in: ಡಾರ್ಕ್ ಮೋಡ್
ta_in: இருள் பயன்முறை

source: &Theme
es_es: &Tema
kn_in: &ಥೀಮ್
ta_in: &தீம்

source: Signal:
ta_in: சிக்னல்:

source: Add All
ta_in: அனைத்தையும் சேர்க்க

source: Cancel
ta_in: ரத்து செய்

source: Add Monitor
ta_in: மாணிட்டர் சேர்க்க

source: Add
ta_in: சேர்க்க

source: Toggle Selected
ta_in: தேர்ந்தெடுக்கப்பட்டதை மாற்று

source: ∞ Continuous
ta_in: ∞ தொடர்ச்சி

source: Add all {x} available signals?
ta_in: {x} கிடைக்கும் சிக்னல்களையும் சேர்க்கவா?

source: HIGH
ta_in: உயர் நிலை

source: LOW
ta_in: குறைந்த நிலை

source: Toggled {switch_name} to {new_state}
ta_in: {switch_name} ஐ {new_state} என மாற்றப்பட்டது

source: How to Use the Logic Simulator GUI --- **Keybinds** - **F1:** Show this Help window - **Alt+F4:** Exit the application - **Spacebar:** Run/Pause the simulation **Simulation Controls** - **Number of Cycles:** Set how many cycles to run the simulation for. - **▶ Run Simulation:** Start the simulation for the chosen number of cycles. - **❚❚ Pause:** Pause the simulation at any time. - **■ Reset:** Reset the simulation and clear all monitor data. - **Speed:** Click to cycle through simulation speeds (x0.5, x1, x2, x4, x8). **Switch Controls** - Toggle individual switches by clicking the switch in the list. - Use **All On** or **All Off** to set all switches high or low. **Monitors** - Add a monitor to track a signal by clicking **Add Monitor** and selecting a signal. - Use **Add All** in the dialog to monitor all available signals. - Remove a monitor by clicking the ✕ button next to it, or **Zap All** to remove all monitors. - The monitor list shows the current state of each monitored signal. **Signal Display Canvas** - The main area shows waveforms for all monitored signals. - **Pan:** Click and drag to move the view. - **Zoom:** Use the mouse wheel to zoom in/out. - Signal colors match the color bars in the monitor list. **Themes** - Switch between Light and Dark mode from the Theme menu. **Status Bar** - The status bar at the bottom shows helpful messages and feedback. For more help, see the project documentation or contact the authors.ಲಾಗಿಕ್ ಸಿಮ್ಯುಲೇಟರ್ GUI ಅನ್ನು ಹೇಗೆ ಬಳಸುವುದು --- **ಕುಂಜಿಪುಟ ಸಂಯೋಜನೆಗಳು** - **F1:** ಸಹಾಯ ವಿಂಡೋವನ್ನು ತೋರಿಸಿ - **Alt+F4:** ಅನ್ವಯವನ್ನು ಮುಚ್ಚಿ - **ಸ್ಪೇಸ್‌ಬಾರ್:** ಸಿಮ್ಯುಲೇಶನ್‌ನ್ನು ಚಾಲನೆ/ವಿರಮಿಸಿ **ಸಿಮ್ಯುಲೇಶನ್ ನಿಯಂತ್ರಣಗಳು** - **ಸೈಕಲ್‌ಗಳ ಸಂಖ್ಯೆ:** ಎಷ್ಟು ಸೈಕಲ್‌ಗಳಿಗೆ ಸಿಮ್ಯುಲೇಶನ್‌ ನಡಿಸಬೇಕು ಎಂದು ಹೊಂದಿಸಿ. - **▶ ಸಿಮ್ಯುಲೇಶನ್‌ ಪ್ರಾರಂಭಿಸಿ:** ಆಯ್ಕೆಮಾಡಿದ ಸೈಕಲ್‌ಗಳಿಗಾಗಿಯೇ ಸಿಮ್ಯುಲೇಶನ್ ಪ್ರಾರಂಭಿಸಿ. - **❚❚ ವಿರಾಮ:** ಯಾವುದೇ ಸಮಯದಲ್ಲಾದರೂ ಸಿಮ್ಯುಲೇಶನ್‌ ನಿಲ್ಲಿಸಿ. - **■ ಮರುಹೊಂದಿಸಿ:** ಸಿಮ್ಯುಲೇಶನ್ ಅನ್ನು ಮರುಹೊಂದಿಸಿ ಮತ್ತು ಎಲ್ಲಾ ಮಾನಿಟರ್ ಡೇಟಾವನ್ನು ಅಳಿಸಿ. - **ವೇಗ:** ಸಿಮ್ಯುಲೇಶನ್ ವೇಗಗಳನ್ನು (x0.5, x1, x2, x4, x8) ಪರಿವರ್ತಿಸಲು ಕ್ಲಿಕ್ ಮಾಡಿ. **ಸ್ವಿಚ್ ನಿಯಂತ್ರಣಗಳು** - ಪಟ್ಟಿ ಉಲ್ಲೇಖಿತ ಸ್ವಿಚ್‌ ಮೇಲೆ ಕ್ಲಿಕ್ ಮಾಡುವ ಮೂಲಕ ಪ್ರತ್ಯೇಕ ಸ್ವಿಚ್‌ಗಳನ್ನು ಟೋಗಲ್ ಮಾಡಿ. - **ಎಲ್ಲಾ ಆನ್** ಅಥವಾ **ಎಲ್ಲಾ ಆಫ್** ಅನ್ನು ಬಳಸುವ ಮೂಲಕ ಎಲ್ಲಾ ಸ್ವಿಚ್‌ಗಳನ್ನು ಉನ್ನತ ಅಥವಾ ತಗ್ಗಿದ ಸ್ಥಿತಿಗೆ ಹೊಂದಿಸಿ. **ಮಾನಿಟರ್‌ಗಳು** - **ಮಾನಿಟರ್‌ ಸೇರಿಸಿ** ಮೇಲೆ ಕ್ಲಿಕ್ ಮಾಡಿ ಮತ್ತು ಒಂದು ಸಿಗ್ನಲ್ ಆಯ್ಕೆಮಾಡುವ ಮೂಲಕ ಮಾನಿಟರ್ ಸೇರಿಸಿ. - ಡೈಲಾಗ್‌ನಲ್ಲಿರುವ **ಎಲ್ಲವೂ ಸೇರಿಸಿ** ಬಳಸಿ ಎಲ್ಲಾ ಲಭ್ಯವಿರುವ ಸಿಗ್ನಲ್‌ಗಳನ್ನು ಮಾನಿಟರ್ ಮಾಡಿ. - ಮಾನಿಟರ್‌ ಪಕ್ಕದ ✕ ಗುಂಡಿಗೆ ಕ್ಲಿಕ್ ಮಾಡುವ ಮೂಲಕ ಅಥವಾ **ಎಲ್ಲವೂ ಅಳಿಸಿ** ಬಳಸುವ ಮೂಲಕ ಎಲ್ಲಾ ಮಾನಿಟರ್‌ಗಳನ್ನು ಅಳಿಸಿ. - ಮಾನಿಟರ್ ಪಟ್ಟಿ ಪ್ರತಿ ಮಾನಿಟರ್ ಮಾಡಿದ ಸಿಗ್ನಲ್‌ನ ಪ್ರಸ್ತುತ ಸ್ಥಿತಿಯನ್ನು ತೋರಿಸುತ್ತದೆ. **ಸಿಗ್ನಲ್ ಪ್ರದರ್ಶನ ಕ್ಯಾಂವಾಸ್** - ಮುಖ್ಯ ಪ್ರದೇಶವು ಎಲ್ಲಾ ಮಾನಿಟರ್ ಮಾಡಲಾದ ಸಿಗ್ನಲ್‌ಗಳ ವೇವ್‌ಫಾರ್ಮ್‌ಗಳನ್ನು ತೋರಿಸುತ್ತದೆ. - **ಪ್ಯಾನ್:** ದೃಶ್ಯವನ್ನು ಸರಿಸಲು ಕ್ಲಿಕ್ ಮಾಡಿ ಮತ್ತು ಎಳೆಯಿರಿ. - **ಜೂಮ್:** ಮೌಸ್ ವೀಲ್ ಬಳಸಿಕೊಂಡು ನಿಖರವಾಗಿ ಅಥವಾ ದೂರವಾಗಿ ವೀಕ್ಷಿಸಿ. - ಸಿಗ್ನಲ್ ಬಣ್ಣಗಳು ಮಾನಿಟರ್ ಪಟ್ಟಿಯಲ್ಲಿನ ಬಣ್ಣ ಪಟ್ಟಿಗಳನ್ನು ಹೊಂದಿಕೆಯಾಗಿವೆ. **ಥೀಮ್‌ಗಳು** - ಥೀಮ್ ಮೆನುವಿಂದ ಲೈಟ್ ಮತ್ತು ಡಾರ್ಕ್ ಮೋಡ್ ನಡುವೆ ಬದಲಾಯಿಸಿ. **ಸ್ಥಿತಿ ಪಟ್ಟೆ** - ಕೆಳಗಿನ ಸ್ಥಿತಿ ಪಟ್ಟೆ ಸಹಾಯಕ ಸಂದೇಶಗಳು ಮತ್ತು ಪ್ರತಿಕ್ರಿಯೆಗಳನ್ನು ತೋರಿಸುತ್ತದೆ. ಹೆಚ್ಚು ಸಹಾಯಕ್ಕಾಗಿ, ಯೋಜನೆಯ ಡಾಕ್ಯುಮೆಂಟೇಶನ್ ಅನ್ನು ನೋಡಿ ಅಥವಾ ಲೇಖಕರನ್ನು ಸಂಪರ್ಕಿಸಿ.
kn_in: ಸಹಾಯ: ತಾರ್ಕಿಕ ಅನುಕರಕವನ್ನು ಹೇಗೆ ಬಳಸುವುದು
